import Image from 'next/image';
import Link from 'next/link';
import styles from './footer.module.css';
export const Footer = () => {
  return (
    <footer className={styles['footer']}>
      <div className="container">
        <div className={styles['footer-wrapper']}>
          <div className={styles['footer-box-Left']}>
            <Link href={'/'} className="brand-color--animate" scroll={false}>
              <Image
                src="logo.svg"
                width={95}
                height={39}
                alt="Genius space"
                className="logo"
              />
            </Link>
            <p>
              ТОВ &quot;КОНСАЛТИНГ СИНДИКАТ&quot;, ЄДРПОУ: 42182763, Адреса:
              02000, м. Київ, вул. Паньківська, 14.
            </p>
            <div>
              <Link href={''} className="brand-color--animate" scroll={false}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="currentColor"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M13.5 8.25V5.25C13.5 4.422 14.172 3.75 15 3.75H16.5V0H13.5C11.0145 0 9 2.0145 9 4.5V8.25H6V12H9V24H13.5V12H16.5L18 8.25H13.5Z"
                    fill="currentColor"
                  />
                </svg>
              </Link>
              <Link href={''} scroll={false}>
                <svg
                  width="23"
                  height="16"
                  viewBox="0 0 23 16"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M22.0364 2.46506C21.7771 1.50114 21.0171 0.741302 20.0533 0.48175C18.2926 0 11.2497 0 11.2497 0C11.2497 0 4.20708 0 2.44638 0.463486C1.50114 0.722763 0.722626 1.50128 0.463348 2.46506C0 4.22562 0 7.87678 0 7.87678C0 7.87678 0 11.5464 0.463348 13.2885C0.7229 14.2523 1.4826 15.0121 2.44652 15.2717C4.22562 15.7536 11.25 15.7536 11.25 15.7536C11.25 15.7536 18.2926 15.7536 20.0533 15.2901C21.0173 15.0307 21.7771 14.2708 22.0366 13.3071C22.4999 11.5464 22.4999 7.89532 22.4999 7.89532C22.4999 7.89532 22.5184 4.22562 22.0364 2.46506ZM9.00741 11.2499V4.50371L14.864 7.87678L9.00741 11.2499Z"
                    fill="currentColor"
                  />
                </svg>
              </Link>
              <Link href={''} scroll={false}>
                <svg
                  width="24"
                  height="20"
                  viewBox="0 0 24 20"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M9.41693 13.1814L9.01994 18.7654C9.58794 18.7654 9.83393 18.5214 10.1289 18.2284L12.7919 15.6834L18.3099 19.7244C19.3219 20.2884 20.0349 19.9914 20.3079 18.7934L23.9299 1.82141L23.9309 1.82041C24.2519 0.324405 23.3899 -0.260595 22.4039 0.106406L1.11393 8.25741C-0.339066 8.82141 -0.317066 9.63141 0.866934 9.99841L6.30993 11.6914L18.9529 3.78041C19.5479 3.38641 20.0889 3.60441 19.6439 3.99841L9.41693 13.1814Z"
                    fill="currentColor"
                  />
                </svg>
              </Link>
              <Link href={''} scroll={false}>
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_1_2339)">
                    <path
                      d="M23.9765 7.05607C23.9203 5.78085 23.7141 4.90416 23.4187 4.14449C23.1139 3.33812 22.6451 2.61617 22.0308 2.01602C21.4307 1.40652 20.704 0.932921 19.9069 0.632936C19.1429 0.337529 18.2707 0.131312 16.9955 0.0750879C15.7108 0.0141019 15.3029 0 12.0445 0C8.78604 0 8.37819 0.0141019 7.09821 0.0703262C5.823 0.126551 4.94631 0.332951 4.18682 0.628174C3.38027 0.932922 2.65832 1.40176 2.05817 2.01602C1.44868 2.61617 0.975256 3.34288 0.675088 4.13991C0.379682 4.90416 0.173465 5.77609 0.11724 7.0513C0.0562543 8.33604 0.0421524 8.7439 0.0421524 12.0023C0.0421524 15.2608 0.0562543 15.6686 0.112479 16.9486C0.168703 18.2238 0.375103 19.1005 0.67051 19.8602C0.975256 20.6666 1.44868 21.3885 2.05817 21.9887C2.65832 22.5982 3.38503 23.0718 4.18206 23.3718C4.94631 23.6672 5.81824 23.8734 7.09364 23.9296C8.37343 23.986 8.78146 23.9999 12.0399 23.9999C15.2984 23.9999 15.7062 23.986 16.9862 23.9296C18.2614 23.8734 19.1381 23.6672 19.8976 23.3718C21.5105 22.7482 22.7857 21.4729 23.4093 19.8602C23.7045 19.096 23.9109 18.2238 23.9672 16.9486C24.0234 15.6686 24.0375 15.2608 24.0375 12.0023C24.0375 8.7439 24.0327 8.33604 23.9765 7.05607ZM21.8153 16.8549C21.7636 18.027 21.5667 18.6599 21.4026 19.0819C20.9994 20.1274 20.1695 20.9572 19.124 21.3605C18.702 21.5246 18.0645 21.7215 16.897 21.7729C15.6311 21.8293 15.2515 21.8433 12.0493 21.8433C8.84703 21.8433 8.46262 21.8293 7.20132 21.7729C6.02922 21.7215 5.39628 21.5246 4.97433 21.3605C4.45402 21.1682 3.98042 20.8634 3.59601 20.4649C3.19749 20.0758 2.89274 19.6069 2.70045 19.0866C2.53635 18.6647 2.33947 18.027 2.28801 16.8596C2.2316 15.5937 2.21769 15.2139 2.21769 12.0117C2.21769 8.80946 2.2316 8.42505 2.28801 7.16394C2.33947 5.99183 2.53635 5.3589 2.70045 4.93694C2.89274 4.41645 3.19749 3.94303 3.60077 3.55843C3.98976 3.15992 4.4586 2.85517 4.97909 2.66306C5.40104 2.49896 6.03874 2.30209 7.20608 2.25044C8.47196 2.19422 8.85179 2.18011 12.0538 2.18011C15.2608 2.18011 15.6405 2.19422 16.9018 2.25044C18.0739 2.30209 18.7068 2.49896 19.1288 2.66306C19.6491 2.85517 20.1227 3.15992 20.5071 3.55843C20.9056 3.94761 21.2103 4.41645 21.4026 4.93694C21.5667 5.3589 21.7636 5.99641 21.8153 7.16394C21.8715 8.42981 21.8856 8.80946 21.8856 12.0117C21.8856 15.2139 21.8715 15.589 21.8153 16.8549Z"
                      fill="currentColor"
                    />
                    <path
                      d="M12.0444 5.83789C8.64072 5.83789 5.87914 8.59929 5.87914 12.0032C5.87914 15.407 8.64072 18.1684 12.0444 18.1684C15.4483 18.1684 18.2097 15.407 18.2097 12.0032C18.2097 8.59929 15.4483 5.83789 12.0444 5.83789ZM12.0444 16.0024C9.83627 16.0024 8.04515 14.2115 8.04515 12.0032C8.04515 9.79484 9.83627 8.0039 12.0444 8.0039C14.2527 8.0039 16.0437 9.79484 16.0437 12.0032C16.0437 14.2115 14.2527 16.0024 12.0444 16.0024Z"
                      fill="currentColor"
                    />
                    <path
                      d="M19.893 5.5936C19.893 6.38844 19.2485 7.03291 18.4535 7.03291C17.6586 7.03291 17.0142 6.38844 17.0142 5.5936C17.0142 4.79859 17.6586 4.1543 18.4535 4.1543C19.2485 4.1543 19.893 4.79859 19.893 5.5936Z"
                      fill="currentColor"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_1_2339">
                      <rect width="24" height="24" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </Link>
            </div>
          </div>
          <div className={styles['footer-box-center']}>
            <h4 className="title-18">О GeniusMarketing</h4>
            <ul>
              <li className="text-13">
                <Link href={'/'} className="brand-color--animate">
                  Головна
                </Link>
              </li>
              <li className="text-13">
                <Link href="" className="brand-color--animate" scroll={false}>
                  Блог
                </Link>
              </li>
              <li className="text-13">
                <Link href={''} className="brand-color--animate" scroll={false}>
                  Про нас
                </Link>
              </li>

              <li className="text-13">
                <Link href={''} className="brand-color--animate" scroll={false}>
                  Навчання
                </Link>
              </li>
            </ul>
          </div>
          <div className={styles['footer-box-right']}>
            <h4 className="title-18">О GeniusMarketing</h4>
            <p className="text-13">
              Україна, Київ, Майдан Незалежності, 2, Spaces Maidan Plaza, 02000
              <br /> <br />
              +38 044 237 13 18 (Україна), <br />
              <br />
              info@geniusmarketing.me
            </p>
          </div>
        </div>
        <div className={styles['copyright-wrapper']}>
          <div>
            <p>© Genius.Space Всі права захищені.</p>
          </div>
          <div className={styles['copyright-wrapper_box-right']}>
            <ul>
              <li>
                <Link href={''} className="brand-color--animate">
                  Умови надання послуг
                </Link>
              </li>
              <li>
                <Link href={''} className="brand-color--animate">
                  Політика конфіденційності
                </Link>
              </li>
              <li>
                <Link href={''} className="brand-color--animate">
                  Умови повернення
                </Link>
              </li>
              <li>
                <Link href={''} className="brand-color--animate">
                  Умови передзамовлення послуг
                </Link>
              </li>
              <li>
                <Link href={''} className="brand-color--animate">
                  Постачальники послуг
                </Link>
              </li>
              <li>
                <Link href={''} className="brand-color--animate">
                  Попередження
                </Link>
              </li>
            </ul>
          </div>
        </div>
      </div>
    </footer>
  );
};
